#### from pandas documentation

In [1]:
import numpy as np
import pandas as pd
f500 = pd.read_csv("f500.csv" , index_col = 0)
f500.head()

,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
company,,,,,,,,,,,,,,,,
Walmart,1,485873,0.8,13643.0,198825,-7.2,C. Douglas McMillon,General Merchandisers,Retailing,1,USA,"Bentonville, AR",http://www.walmart.com,23,2300000,77798
State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
Sinopec Group,3,267518,-9.1,1257.9,310726,-65.0,Wang Yupu,Petroleum Refining,Energy,4,China,"Beijing, China",http://www.sinopec.com,19,713288,106523
China National Petroleum,4,262573,-12.3,1867.5,585619,-73.7,Zhang Jianhua,Petroleum Refining,Energy,3,China,"Beijing, China",http://www.cnpc.com.cn,17,1512048,301893
Toyota Motor,5,254694,7.7,16899.3,437575,-12.3,Akio Toyoda,Motor Vehicles and Parts,Motor Vehicles & Parts,8,Japan,"Toyota, Japan",http://www.toyota-global.com,23,364445,157210

In [2]:
f500.tail(3)

,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
company,,,,,,,,,,,,,,,,
Wm. Morrison Supermarkets,498,21741,-11.3,406.4,11630,20.4,David T. Potts,Food and Drug Stores,Food & Drug Stores,437,Britain,"Bradford, Britain",http://www.morrisons.com,13,77210,5111
TUI,499,21655,-5.5,1151.7,16247,195.5,Friedrich Joussen,Travel Services,Business Services,467,Germany,"Hanover, Germany",http://www.tuigroup.com,23,66779,3006
AutoNation,500,21609,3.6,430.5,10060,-2.7,Michael J. Jackson,Specialty Retailers,Retailing,0,USA,"Fort Lauderdale, FL",http://www.autonation.com,12,26000,2310

In [3]:
#print some information about the dataset
f500.info()
print(f500.shape)

<class 'pandas.core.frame.DataFrame'>
Index: 500 entries, Walmart to AutoNation
Data columns (total 16 columns):
rank                        500 non-null int64
revenues                    500 non-null int64
revenue_change              498 non-null float64
profits                     499 non-null float64
assets                      500 non-null int64
profit_change               436 non-null float64
ceo                         500 non-null object
industry                    500 non-null object
sector                      500 non-null object
previous_rank               500 non-null int64
country                     500 non-null object
hq_location                 500 non-null object
website                     500 non-null object
years_on_global_500_list    500 non-null int64
employees                   500 non-null int64
total_stockholder_equity    500 non-null int64
dtypes: float64(3), int64(7), object(6)
memory usage: 66.4+ KB
(500, 16)

In [103]:
f500.describe(include = "all")

,company,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity,rank_change,roa
count,500,500.000000,500.000000,498.000000,499.000000,5.000000e+02,436.000000,500,500,500,467.000000,500,500,500,500.000000,5.000000e+02,500.000000,467.000000,499.000000
unique,500,NaN,NaN,NaN,NaN,NaN,NaN,500,58,21,NaN,34,235,500,NaN,NaN,NaN,NaN,NaN
top,Prudential Financial,NaN,NaN,NaN,NaN,NaN,NaN,Markus Mosa,Banks: Commercial and Savings,Financials,NaN,USA,"Beijing, China",http://www.sxcc.com.cn,NaN,NaN,NaN,NaN,NaN
freq,1,NaN,NaN,NaN,NaN,NaN,NaN,1,51,118,NaN,132,56,1,NaN,NaN,NaN,NaN,NaN
mean,NaN,250.500000,55416.358000,4.538353,3055.203206,2.436323e+05,24.152752,NaN,NaN,NaN,237.830835,NaN,NaN,NaN,15.036000,1.339983e+05,30628.076000,-3.533191,0.030428
std,NaN,144.481833,45725.478963,28.549067,5171.981071,4.851937e+05,437.509566,NaN,NaN,NaN,139.211279,NaN,NaN,NaN,7.932752,1.700878e+05,43642.576833,44.293603,0.043733
min,NaN,1.000000,21609.000000,-67.300000,-13038.000000,3.717000e+03,-793.700000,NaN,NaN,NaN,1.000000,NaN,NaN,NaN,1.000000,3.280000e+02,-59909.000000,-199.000000,-0.237236
25%,NaN,125.750000,29003.000000,-5.900000,556.950000,3.658850e+04,-22.775000,NaN,NaN,NaN,117.500000,NaN,NaN,NaN,7.000000,4.293250e+04,7553.750000,-21.000000,0.005632
50%,NaN,250.500000,40236.000000,0.550000,1761.600000,7.326150e+04,-0.350000,NaN,NaN,NaN,236.000000,NaN,NaN,NaN,17.000000,9.291050e+04,15809.500000,-2.000000,0.021783
75%,NaN,375.250000,63926.750000,6.975000,3954.000000,1.805640e+05,17.700000,NaN,NaN,NaN,355.500000,NaN,NaN,NaN,23.000000,1.689172e+05,37828.500000,10.000000,0.044978
max,NaN,500.000000,485873.000000,442.300000,45687.000000,3.473238e+06,8909.500000,NaN,NaN,NaN,500.000000,NaN,NaN,NaN,23.000000,2.300000e+06,301893.000000,226.000000,0.236955

In [5]:
rank_change = f500["previous_rank"] - f500["rank"]
f500["rank_change"] = rank_change
f500["rank_change"].notnull().value_counts()

True    500
Name: rank_change, dtype: int64

In [6]:
df2 = f500.loc["Walmart" : "Apple" , ["rank" , "country" , "rank_change"]]
df2

                          rank      country  rank_change
company
Walmart                      1          USA            0
State Grid                   2        China            0
Sinopec Group                3        China            1
China National Petroleum     4        China           -1
Toyota Motor                 5        Japan            3
Volkswagen                   6      Germany            1
Royal Dutch Shell            7  Netherlands           -2
Berkshire Hathaway           8          USA            3
Apple                        9          USA            0

In [7]:
f500.loc[:, ["assets" , "revenues"]]

                                assets  revenues
company
Walmart                         198825    485873
State Grid                      489838    315199
Sinopec Group                   310726    267518
China National Petroleum        585619    262573
Toyota Motor                    437575    254694
...                                ...       ...
Teva Pharmaceutical Industries   92890     21903
New China Life Insurance        100609     21796
Wm. Morrison Supermarkets        11630     21741
TUI                              16247     21655
AutoNation                       10060     21609

[500 rows x 2 columns]

In [8]:
f500.loc[["Walmart" , "Apple"]]

,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity,rank_change
company,,,,,,,,,,,,,,,,,
Walmart,1,485873,0.8,13643.0,198825,-7.2,C. Douglas McMillon,General Merchandisers,Retailing,1,USA,"Bentonville, AR",http://www.walmart.com,23,2300000,77798,0
Apple,9,215639,-7.7,45687.0,321686,-14.4,Timothy D. Cook,"Computers, Office Equipment",Technology,9,USA,"Cupertino, CA",http://www.apple.com,15,116000,128249,0

In [9]:
type(f500["rank"])

pandas.core.series.Series

In [10]:
f500.loc["Walmart"]

rank                                             1
revenues                                    485873
revenue_change                                 0.8
profits                                      13643
assets                                      198825
profit_change                                 -7.2
ceo                            C. Douglas McMillon
industry                     General Merchandisers
sector                                   Retailing
previous_rank                                    1
country                                        USA
hq_location                        Bentonville, AR
website                     http://www.walmart.com
years_on_global_500_list                        23
employees                                  2300000
total_stockholder_equity                     77798
rank_change                                      0
Name: Walmart, dtype: object

In [11]:
f500["country"].isnull().value_counts()

False    500
Name: country, dtype: int64

In [12]:
f500["country"].describe()

count     500
unique     34
top       USA
freq      132
Name: country, dtype: object

In [13]:
f500["country"].head()["Toyota Motor"]

'Japan'

In [14]:
f500["rank"].head().loc["State Grid"]

2

In [15]:
zero_prev_ranks = f500["previous_rank"].value_counts()[0]

In [16]:
f500.max(numeric_only = True)

rank                            500.0
revenues                     485873.0
revenue_change                  442.3
profits                       45687.0
assets                      3473238.0
profit_change                  8909.5
previous_rank                   500.0
years_on_global_500_list         23.0
employees                   2300000.0
total_stockholder_equity     301893.0
rank_change                     226.0
dtype: float64

In [17]:
max_f500 = f500.min(numeric_only = True)

In [18]:
f500.describe() # to bring some statistics

,rank,revenues,revenue_change,profits,assets,profit_change,previous_rank,years_on_global_500_list,employees,total_stockholder_equity,rank_change
count,500.000000,500.000000,498.000000,499.000000,5.000000e+02,436.000000,500.000000,500.000000,5.000000e+02,500.000000,500.000000
mean,250.500000,55416.358000,4.538353,3055.203206,2.436323e+05,24.152752,222.134000,15.036000,1.339983e+05,30628.076000,-28.366000
std,144.481833,45725.478963,28.549067,5171.981071,4.851937e+05,437.509566,146.941961,7.932752,1.700878e+05,43642.576833,108.602823
min,1.000000,21609.000000,-67.300000,-13038.000000,3.717000e+03,-793.700000,0.000000,1.000000,3.280000e+02,-59909.000000,-500.000000
25%,125.750000,29003.000000,-5.900000,556.950000,3.658850e+04,-22.775000,92.750000,7.000000,4.293250e+04,7553.750000,-28.250000
50%,250.500000,40236.000000,0.550000,1761.600000,7.326150e+04,-0.350000,219.500000,17.000000,9.291050e+04,15809.500000,-4.000000
75%,375.250000,63926.750000,6.975000,3954.000000,1.805640e+05,17.700000,347.250000,23.000000,1.689172e+05,37828.500000,8.250000
max,500.000000,485873.000000,442.300000,45687.000000,3.473238e+06,8909.500000,500.000000,23.000000,2.300000e+06,301893.000000,226.000000

In [19]:
f500.describe(include = "O")

,ceo,industry,sector,country,hq_location,website
count,500,500,500,500,500,500
unique,500,58,21,34,235,500
top,Markus Mosa,Banks: Commercial and Savings,Financials,USA,"Beijing, China",http://www.sxcc.com.cn
freq,1,51,118,132,56,1

In [20]:
iam_ceo = f500.loc["Walmart" , "ceo"] = "Eslam Hosam"
iam_ceo

'Eslam Hosam'

In [105]:
f500.loc["Amazon.com" , "ceo"] = "Mada"

f500.loc["Amazon.com" , "ceo"]

'Mada'

In [108]:
motor_countries = f500.loc[f500["industry"] == "Motor Vehicles and Parts" , "country"]
print(motor_countries)
motor_countries.value_counts()

4            Japan
5          Germany
16         Germany
17             USA
20             USA
28           Japan
40           China
43           Japan
51         Germany
67           China
75         Germany
77     South Korea
124          China
136          China
139         France
156         France
208    South Korea
212        Germany
235          Japan
237          China
246          India
262        Germany
278          China
289         Canada
300         Sweden
322    South Korea
323          Japan
342          China
351          Japan
352          Japan
366          Japan
372          Japan
419          Japan
465         France
Name: country, dtype: object

Japan          10
China           7
Germany         6
France          3
South Korea     3
USA             2
India           1
Sweden          1
Canada          1
Name: country, dtype: int64

In [109]:
motor_countries[motor_countries == "Japan"]

4      Japan
28     Japan
43     Japan
235    Japan
323    Japan
351    Japan
352    Japan
366    Japan
372    Japan
419    Japan
Name: country, dtype: object

In [24]:
motor_countries.loc[motor_countries == "China"]

company
SAIC Motor                             China
Dongfeng Motor                         China
China FAW Group                        China
Beijing Automotive Group               China
Guangzhou Automobile Industry Group    China
Jardine Matheson                       China
Zhejiang Geely Holding Group           China
Name: country, dtype: object

In [25]:
motor_countries[motor_countries == "USA"]

company
General Motors    USA
Ford Motor        USA
Name: country, dtype: object

In [26]:
motor_countries[motor_countries == "USA"] = "OM Eldonia"
motor_countries[motor_countries == "Japan"] = "Egypt"
motor_countries["Toyota Motor"]

'Egypt'

In [27]:
prev_rank_before = f500.loc[f500["previous_rank"] == 0 , "previous_rank"]
print(prev_rank_before.value_counts())
f500.loc[f500["previous_rank"] == 0 , "previous_rank"] = np.nan
prev_rank_after = f500["previous_rank"].value_counts(dropna = False)
prev_rank_after

0    33
Name: previous_rank, dtype: int64

NaN      33
471.0     1
234.0     1
125.0     1
166.0     1
         ..
191.0     1
369.0     1
179.0     1
161.0     1
1.0       1
Name: previous_rank, Length: 468, dtype: int64

In [28]:
f500["new_ceo"] = "Egyptian King MO in " + f500["country"]
f500["new_ceo"].value_counts().head()

Egyptian King MO in USA        132
Egyptian King MO in China      109
Egyptian King MO in Japan       51
Egyptian King MO in Germany     29
Egyptian King MO in France      29
Name: new_ceo, dtype: int64

In [29]:
f500.head(2)

,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity,rank_change,new_ceo
company,,,,,,,,,,,,,,,,,,
Walmart,1,485873,0.8,13643.0,198825,-7.2,Eslam Hosam,General Merchandisers,Retailing,1.0,USA,"Bentonville, AR",http://www.walmart.com,23,2300000,77798,0,Egyptian King MO in USA
State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2.0,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456,0,Egyptian King MO in China

In [30]:
f500["rank_change"] = f500["previous_rank"] - f500["rank"]
rank_change_desc = f500["rank_change"].describe()
rank_change_desc

count    467.000000
mean      -3.533191
std       44.293603
min     -199.000000
25%      -21.000000
50%       -2.000000
75%       10.000000
max      226.000000
Name: rank_change, dtype: float64

In [31]:
# top industry companies headquartered in usa 
usa_companies = f500.loc[f500["country"] == "USA" , "industry"]
usa_companies.value_counts().head()

Banks: Commercial and Savings               8
Insurance: Property and Casualty (Stock)    7
Health Care: Insurance and Managed Care     6
Specialty Retailers                         6
Petroleum Refining                          6
Name: industry, dtype: int64

In [32]:
#most common sector values for companies in china
chinese_sectors = f500.loc[f500["country"] == "China" , "sector"]
chinese_sectors.value_counts(dropna = False).head(3)

Financials     25
Energy         22
Wholesalers     9
Name: sector, dtype: int64

In [33]:
f500.loc[f500["country"] == "om eldonia" , "country"] = "Om Eldonia"
f500["country"].value_counts()

USA             132
China           109
Japan            51
Germany          29
France           29
Britain          24
South Korea      15
Netherlands      14
Switzerland      14
Canada           11
Spain             9
Australia         7
Brazil            7
Italy             7
India             7
Taiwan            6
Russia            4
Ireland           4
Singapore         3
Sweden            3
Mexico            2
Finland           1
Indonesia         1
Venezuela         1
Turkey            1
Saudi Arabia      1
Norway            1
Thailand          1
Malaysia          1
U.A.E             1
Israel            1
Denmark           1
Belgium           1
Luxembourg        1
Name: country, dtype: int64

## exploring data basics without string labels

In [34]:
f500 = pd.read_csv("f500.csv") 
f500.head()

,company,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
0,Walmart,1,485873,0.8,13643.0,198825,-7.2,C. Douglas McMillon,General Merchandisers,Retailing,1,USA,"Bentonville, AR",http://www.walmart.com,23,2300000,77798
1,State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
2,Sinopec Group,3,267518,-9.1,1257.9,310726,-65.0,Wang Yupu,Petroleum Refining,Energy,4,China,"Beijing, China",http://www.sinopec.com,19,713288,106523
3,China National Petroleum,4,262573,-12.3,1867.5,585619,-73.7,Zhang Jianhua,Petroleum Refining,Energy,3,China,"Beijing, China",http://www.cnpc.com.cn,17,1512048,301893
4,Toyota Motor,5,254694,7.7,16899.3,437575,-12.3,Akio Toyoda,Motor Vehicles and Parts,Motor Vehicles & Parts,8,Japan,"Toyota, Japan",http://www.toyota-global.com,23,364445,157210

In [35]:
f500.loc[f500["previous_rank"] == 0 , "previous_rank"] = np.nan

In [36]:
f500.iloc[0 , 0]
print(f500.iloc[0])

company                                    Walmart
rank                                             1
revenues                                    485873
revenue_change                                 0.8
profits                                      13643
assets                                      198825
profit_change                                 -7.2
ceo                            C. Douglas McMillon
industry                     General Merchandisers
sector                                   Retailing
previous_rank                                    1
country                                        USA
hq_location                        Bentonville, AR
website                     http://www.walmart.com
years_on_global_500_list                        23
employees                                  2300000
total_stockholder_equity                     77798
Name: 0, dtype: object

In [37]:
company = f500.iloc[:, 0]
company

0                             Walmart
1                          State Grid
2                       Sinopec Group
3            China National Petroleum
4                        Toyota Motor
                    ...
495    Teva Pharmaceutical Industries
496          New China Life Insurance
497         Wm. Morrison Supermarkets
498                               TUI
499                        AutoNation
Name: company, Length: 500, dtype: object

In [38]:
df = f500.iloc[:5 , 0:4]
df

                    company  rank  revenues  revenue_change
0                   Walmart     1    485873             0.8
1                State Grid     2    315199            -4.4
2             Sinopec Group     3    267518            -9.1
3  China National Petroleum     4    262573           -12.3
4              Toyota Motor     5    254694             7.7

In [39]:
rows = f500.iloc[[1 , 5 , 10]]
rows

,company,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
1,State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2.0,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
5,Volkswagen,6,240264,1.5,5937.3,432116,NaN,Matthias Muller,Motor Vehicles and Parts,Motor Vehicles & Parts,7.0,Germany,"Wolfsburg, Germany",http://www.volkswagen.com,23,626715,97753
10,McKesson,11,198533,3.1,5070.0,60969,124.5,John H. Hammergren,Wholesalers: Health Care,Wholesalers,12.0,USA,"San Francisco, CA",http://www.mckesson.com,23,64500,11095

In [40]:
print(rows.loc[10]) 
print(rows.iloc[2])

company                                     McKesson
rank                                              11
revenues                                      198533
revenue_change                                   3.1
profits                                         5070
assets                                         60969
profit_change                                  124.5
ceo                               John H. Hammergren
industry                    Wholesalers: Health Care
sector                                   Wholesalers
previous_rank                                     12
country                                          USA
hq_location                        San Francisco, CA
website                      http://www.mckesson.com
years_on_global_500_list                          23
employees                                      64500
total_stockholder_equity                       11095
Name: 10, dtype: object
company                                     McKesson
rank                                              11
revenues                                      198533
revenue_change                                   3.1
profits                                         5070
assets                                         60969
profit_change                                  124.5
ceo                               John H. Hammergren
industry                    Wholesalers: Health Care
sector                                   Wholesalers
previous_rank                                     12
country                                          USA
hq_location                        San Francisco, CA
website                      http://www.mckesson.com
years_on_global_500_list                          23
employees                                      64500
total_stockholder_equity                       11095
Name: 10, dtype: object

In [41]:
f500.iloc[0:3]

,company,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
0,Walmart,1,485873,0.8,13643.0,198825,-7.2,C. Douglas McMillon,General Merchandisers,Retailing,1.0,USA,"Bentonville, AR",http://www.walmart.com,23,2300000,77798
1,State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2.0,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
2,Sinopec Group,3,267518,-9.1,1257.9,310726,-65.0,Wang Yupu,Petroleum Refining,Energy,4.0,China,"Beijing, China",http://www.sinopec.com,19,713288,106523

In [42]:
f500.iloc[[5,6,18] , :5]

              company  rank  revenues  revenue_change  profits
5          Volkswagen     6    240264             1.5   5937.3
6   Royal Dutch Shell     7    240033           -11.8   4575.0
18               AT&T    19    163786            11.6  12976.0

In [43]:
f500.loc[f500.iloc[:,1] < 5 , "company"]

0                     Walmart
1                  State Grid
2               Sinopec Group
3    China National Petroleum
Name: company, dtype: object

In [44]:
f500.loc[f500.iloc[:,6].isnull() , "company"]

5                                        Volkswagen
7                                Berkshire Hathaway
11                                               BP
15                                         Glencore
22                                AmerisourceBergen
                           ...
472                                          Altice
473                                            Onex
475    Shanxi Jincheng Anthracite Coal Mining Group
488                                  Sears Holdings
492                                  Telecom Italia
Name: company, Length: 64, dtype: object

In [45]:
prev_null = f500.loc[f500["previous_rank"].isnull() ,["rank" , "previous_rank" , "company"]].head()
prev_null

     rank  previous_rank                 company
48     49            NaN   Legal & General Group
90     91            NaN                  Uniper
123   124            NaN       Dell Technologies
138   139            NaN  Anbang Insurance Group
140   141            NaN         Albertsons Cos.

In [46]:
print(prev_null.loc[90] , "\n")
print(prev_null.iloc[1])

rank                 91
previous_rank       NaN
company          Uniper
Name: 90, dtype: object

rank                 91
previous_rank       NaN
company          Uniper
Name: 90, dtype: object

In [47]:
previously_ranked = f500["previous_rank"].notnull()
rank_change =  f500.loc[previously_ranked , "previous_rank"] - f500["rank"]
previously_ranked.value_counts()

True     467
False     33
Name: previous_rank, dtype: int64

In [48]:
f500["rank_change"] = rank_change
f500["rank_change"].value_counts(dropna = False)

 NaN     33
-1.0     14
-4.0     13
-2.0     12
 8.0     12
         ..
-54.0     1
 55.0     1
 69.0     1
 21.0     1
-32.0     1
Name: rank_change, Length: 153, dtype: int64

In [49]:
# boolean operators and , or , not
big_rev_neg_profit = f500[(f500["revenues"] > 100000) & (f500["profits"] < 0 ) ]
big_rev_neg_profit

,company,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity,rank_change
32,Japan Post Holdings,33,122990,3.6,-267.4,2631385,-107.5,Masatsugu Nagato,"Insurance: Life, Health (stock)",Financials,37.0,Japan,"Tokyo, Japan",http://www.japanpost.jp,21,248384,91532,4.0
44,Chevron,45,107567,-18.0,-497.0,260078,-110.8,John S. Watson,Petroleum Refining,Energy,31.0,USA,"San Ramon, CA",http://www.chevron.com,23,55200,145556,-14.0

In [50]:
low_rev_neg_profit = f500[(f500["revenues"] < 100000) & (f500["profits"] < 0)]
low_rev_neg_profit.loc[low_rev_neg_profit["rank_change"].notnull()].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 34 entries, 74 to 488
Data columns (total 18 columns):
company                     34 non-null object
rank                        34 non-null int64
revenues                    34 non-null int64
revenue_change              34 non-null float64
profits                     34 non-null float64
assets                      34 non-null int64
profit_change               11 non-null float64
ceo                         34 non-null object
industry                    34 non-null object
sector                      34 non-null object
previous_rank               34 non-null float64
country                     34 non-null object
hq_location                 34 non-null object
website                     34 non-null object
years_on_global_500_list    34 non-null int64
employees                   34 non-null int64
total_stockholder_equity    34 non-null int64
rank_change                 34 non-null float64
dtypes: float64(5), int64(6), object(7)
memory usage: 5.0+ KB

In [51]:
jap_ven = f500[(f500["country"] == "Venezuela") | (f500["country"] == "Japan")]

In [52]:
tech_outside_usa = f500.loc[(f500["country"] != "USA") & (f500["sector"] == "Technology") , "company"].head()
tech_outside_usa

14             Samsung Electronics
26      Hon Hai Precision Industry
70                         Hitachi
82     Huawei Investment & Holding
104                           Sony
Name: company, dtype: object

In [53]:
tech_inside_china = f500.loc[(f500["sector"] == "Technology") &(f500["country"] == "China") , "company"]
tech_inside_china

82     Huawei Investment & Holding
182       Amer International Group
225                   Lenovo Group
260                         JD.com
361              China Electronics
449                    Midea Group
461          Alibaba Group Holding
477               Tencent Holdings
Name: company, dtype: object

In [54]:
f500[["company" , "rank_change"]].sort_values("rank_change").head()

                      company  rank_change
230                      E.ON       -199.0
349              BHP Billiton       -182.0
193                        HP       -146.0
429    Datong Coal Mine Group       -108.0
489  China General Technology       -107.0

In [55]:
f500[["company" , "revenues", "country"]].sort_values("country" )

                                   company  revenues    country
197                             Wesfarmers     48003  Australia
390                        Westpac Banking     27704  Australia
404                National Australia Bank     26958  Australia
349                           BHP Billiton     30912  Australia
417  Australia & New Zealand Banking Group     26032  Australia
..                                     ...       ...        ...
257                               Best Buy     39403        USA
259                Honeywell International     39302        USA
228                                  Bunge     42679        USA
499                             AutoNation     21609        USA
441        Mercantil Servicios Financieros     24403  Venezuela

[500 rows x 3 columns]

In [56]:
selected_rows = f500[f500["country"] == "China"]
selected_rows.sort_values("employees" , ascending = False)[["company" , "employees"]]

                                company  employees
3              China National Petroleum    1512048
118                    China Post Group     941211
1                            State Grid     926067
2                         Sinopec Group     713288
37           Agricultural Bank of China     501368
..                                  ...        ...
182            Amer International Group      17852
128                         Tewoo Group      17353
438  China National Aviation Fuel Group      11739
458             Yango Financial Holding      10234
204                         Noble Group       1000

[109 rows x 2 columns]

In [57]:
japan_emp = f500.loc[f500["country"] == "Japan" , ["company" , "country" , "employees"]].sort_values(by = "employees")
#company headquartered in Japan with the largest number of employees.
top_japanese_employer = japan_emp.tail().loc[4]
top_japanese_employer

company      Toyota Motor
country             Japan
employees          364445
Name: 4, dtype: object

In [58]:
f500[["company" , "country" , "rank" , "rank_change"]].sort_values(by = "rank" )

                            company  country  rank  rank_change
0                           Walmart      USA     1          0.0
1                        State Grid    China     2          0.0
2                     Sinopec Group    China     3          1.0
3          China National Petroleum    China     4         -1.0
4                      Toyota Motor    Japan     5          3.0
..                              ...      ...   ...          ...
495  Teva Pharmaceutical Industries   Israel   496          NaN
496        New China Life Insurance    China   497        -70.0
497       Wm. Morrison Supermarkets  Britain   498        -61.0
498                             TUI  Germany   499        -32.0
499                      AutoNation      USA   500          NaN

[500 rows x 4 columns]

In [59]:
# using loops with pandas Aggregation
dic = {}
for c in f500["country"].unique():
    selected_rows = f500[f500["country"] == c]
    sorted_rows = selected_rows.sort_values(by = "employees" , ascending = False)
    first_row = sorted_rows.iloc[0]
    company = first_row["company"]
    dic[c] = company
    
dic

{'USA': 'Walmart',
 'China': 'China National Petroleum',
 'Japan': 'Toyota Motor',
 'Germany': 'Volkswagen',
 'Netherlands': 'EXOR Group',
 'Britain': 'Compass Group',
 'South Korea': 'Samsung Electronics',
 'Switzerland': 'Nestle',
 'France': 'Sodexo',
 'Taiwan': 'Hon Hai Precision Industry',
 'Singapore': 'Flex',
 'Italy': 'Poste Italiane',
 'Russia': 'Gazprom',
 'Spain': 'Banco Santander',
 'Brazil': 'JBS',
 'Mexico': 'America Movil',
 'Luxembourg': 'ArcelorMittal',
 'India': 'State Bank of India',
 'Malaysia': 'Petronas',
 'Thailand': 'PTT',
 'Australia': 'Wesfarmers',
 'Belgium': 'Anheuser-Busch InBev',
 'Norway': 'Statoil',
 'Canada': 'George Weston',
 'Ireland': 'Accenture',
 'Indonesia': 'Pertamina',
 'Denmark': 'Maersk Group',
 'Saudi Arabia': 'SABIC',
 'Sweden': 'H & M Hennes & Mauritz',
 'Finland': 'Nokia',
 'Venezuela': 'Mercantil Servicios Financieros',
 'Turkey': 'Koc Holding',
 'U.A.E': 'Emirates Group',
 'Israel': 'Teva Pharmaceutical Industries'}

In [60]:
f500["roa"] = f500["profits"] / f500["assets"]
top_roa_by_sector = {}

for s in f500["sector"].unique():
    selected_rows = f500[f500["sector"] == s].sort_values(by = "roa" , ascending = False)
    first_row = selected_rows.iloc[0]
    comp = first_row["company"]
    top_roa_by_sector[s] = comp
    
top_roa_by_sector

{'Retailing': 'H & M Hennes & Mauritz',
 'Energy': 'National Grid',
 'Motor Vehicles & Parts': 'Subaru',
 'Financials': 'Berkshire Hathaway',
 'Technology': 'Accenture',
 'Wholesalers': 'McKesson',
 'Health Care': 'Gilead Sciences',
 'Telecommunications': 'KDDI',
 'Engineering & Construction': 'Pacific Construction Group',
 'Industrials': '3M',
 'Food & Drug Stores': 'Publix Super Markets',
 'Aerospace & Defense': 'Lockheed Martin',
 'Food, Beverages & Tobacco': 'Philip Morris International',
 'Household Products': 'Unilever',
 'Transportation': 'Delta Air Lines',
 'Materials': 'CRH',
 'Chemicals': 'LyondellBasell Industries',
 'Media': 'Disney',
 'Apparel': 'Nike',
 'Hotels, Restaurants & Leisure': 'McDonald’s',
 'Business Services': 'Adecco Group'}

## mission 6 data cleaning basics

In [61]:
laptops = pd.read_csv("laptops.csv" , encoding = "Latin-1")
laptops.head()

,Manufacturer,Model Name,Category,Screen Size,Screen,CPU,RAM,Storage,GPU,Operating System,Operating System Version,Weight,Price (Euros)
0,Apple,MacBook Pro,Ultrabook,"13.3""",IPS Panel Retina Display 2560x1600,Intel Core i5 2.3GHz,8GB,128GB SSD,Intel Iris Plus Graphics 640,macOS,NaN,1.37kg,"1339,69"
1,Apple,Macbook Air,Ultrabook,"13.3""",1440x900,Intel Core i5 1.8GHz,8GB,128GB Flash Storage,Intel HD Graphics 6000,macOS,NaN,1.34kg,"898,94"
2,HP,250 G6,Notebook,"15.6""",Full HD 1920x1080,Intel Core i5 7200U 2.5GHz,8GB,256GB SSD,Intel HD Graphics 620,No OS,NaN,1.86kg,"575,00"
3,Apple,MacBook Pro,Ultrabook,"15.4""",IPS Panel Retina Display 2880x1800,Intel Core i7 2.7GHz,16GB,512GB SSD,AMD Radeon Pro 455,macOS,NaN,1.83kg,"2537,45"
4,Apple,MacBook Pro,Ultrabook,"13.3""",IPS Panel Retina Display 2560x1600,Intel Core i5 3.1GHz,8GB,256GB SSD,Intel Iris Plus Graphics 650,macOS,NaN,1.37kg,"1803,60"

In [62]:
laptops.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1303 entries, 0 to 1302
Data columns (total 13 columns):
Manufacturer                1303 non-null object
Model Name                  1303 non-null object
Category                    1303 non-null object
Screen Size                 1303 non-null object
Screen                      1303 non-null object
CPU                         1303 non-null object
RAM                         1303 non-null object
 Storage                    1303 non-null object
GPU                         1303 non-null object
Operating System            1303 non-null object
Operating System Version    1133 non-null object
Weight                      1303 non-null object
Price (Euros)               1303 non-null object
dtypes: object(13)
memory usage: 132.5+ KB

In [63]:
laptops["Operating System Version"].isnull().value_counts()

False    1133
True      170
Name: Operating System Version, dtype: int64

In [64]:
print(laptops.columns)

Index(['Manufacturer', 'Model Name', 'Category', 'Screen Size', 'Screen',
       'CPU', 'RAM', ' Storage', 'GPU', 'Operating System',
       'Operating System Version', 'Weight', 'Price (Euros)'],
      dtype='object')

In [65]:
columns = []

def clean_column(c):
    c = c.strip()
    c = c.replace("Operating System Version" , "os")
    c = c.lower()
    c = c.replace("(" , "")
    c = c.replace(")" , "")
    c = c.replace(" " , "_")
    return c
    
for col in laptops.columns:
    col = clean_column(col)
    columns.append(col)
    
laptops.columns = columns
laptops.head(2)

,manufacturer,model_name,category,screen_size,screen,cpu,ram,storage,gpu,operating_system,os,weight,price_euros
0,Apple,MacBook Pro,Ultrabook,"13.3""",IPS Panel Retina Display 2560x1600,Intel Core i5 2.3GHz,8GB,128GB SSD,Intel Iris Plus Graphics 640,macOS,NaN,1.37kg,"1339,69"
1,Apple,Macbook Air,Ultrabook,"13.3""",1440x900,Intel Core i5 1.8GHz,8GB,128GB Flash Storage,Intel HD Graphics 6000,macOS,NaN,1.34kg,"898,94"

In [66]:
#all columns are object dtype
laptops.dtypes

manufacturer        object
model_name          object
category            object
screen_size         object
screen              object
cpu                 object
ram                 object
storage             object
gpu                 object
operating_system    object
os                  object
weight              object
price_euros         object
dtype: object

In [67]:
print(laptops.iloc[0:5 , 2:5])

    category screen_size                              screen
0  Ultrabook       13.3"  IPS Panel Retina Display 2560x1600
1  Ultrabook       13.3"                            1440x900
2   Notebook       15.6"                   Full HD 1920x1080
3  Ultrabook       15.4"  IPS Panel Retina Display 2880x1800
4  Ultrabook       13.3"  IPS Panel Retina Display 2560x1600

In [68]:
#exploring a cplumn for cleaning
print(laptops["screen_size"].dtype)
print(laptops["screen_size"].unique())

object
['13.3"' '15.6"' '15.4"' '14.0"' '12.0"' '11.6"' '17.3"' '10.1"' '13.5"'
 '12.5"' '13.0"' '18.4"' '13.9"' '12.3"' '17.0"' '15.0"' '14.1"' '11.3"']

In [69]:
laptops["screen_size"] = laptops["screen_size"].str.replace('"' , '')
laptops["screen_size"].unique()

array(['13.3', '15.6', '15.4', '14.0', '12.0', '11.6', '17.3', '10.1',
       '13.5', '12.5', '13.0', '18.4', '13.9', '12.3', '17.0', '15.0',
       '14.1', '11.3'], dtype=object)

In [70]:
# convert the column values to numeric dtypes
laptops["screen_size"] = laptops["screen_size"].astype(float)
laptops["screen_size"].dtype

dtype('float64')

In [71]:
# identify the ram column
print(laptops["ram"].dtype)
print(laptops["ram"].unique())

object
['8GB' '16GB' '4GB' '2GB' '12GB' '6GB' '32GB' '24GB' '64GB']

- notice we need to remove "GB" string then convert to numeric (int)

In [72]:
laptops["ram"] = laptops["ram"].str.replace("GB" , "")
laptops["ram"] = laptops["ram"].astype(int)
print(laptops["ram"].dtype)
print(laptops["ram"].unique())

int32
[ 8 16  4  2 12  6 32 24 64]

In [73]:
print(laptops.dtypes)

manufacturer         object
model_name           object
category             object
screen_size         float64
screen               object
cpu                  object
ram                   int32
storage              object
gpu                  object
operating_system     object
os                   object
weight               object
price_euros          object
dtype: object

In [74]:
# changing a column name
laptops.rename({"ram" : "ram_gb"} , axis = 1 , inplace = True)
print(laptops.columns)
laptops["ram_gb"].describe()

Index(['manufacturer', 'model_name', 'category', 'screen_size', 'screen',
       'cpu', 'ram_gb', 'storage', 'gpu', 'operating_system', 'os', 'weight',
       'price_euros'],
      dtype='object')

count    1303.000000
mean        8.382195
std         5.084665
min         2.000000
25%         4.000000
50%         8.000000
75%         8.000000
max        64.000000
Name: ram_gb, dtype: float64

In [75]:
# extracting values from string
print(laptops["gpu"].head())

0    Intel Iris Plus Graphics 640
1          Intel HD Graphics 6000
2           Intel HD Graphics 620
3              AMD Radeon Pro 455
4    Intel Iris Plus Graphics 650
Name: gpu, dtype: object

- we get the manufacturer name from the first word (intel , AMD)

In [76]:
# split the string 
laptops["gpu"].str.split()

0       [Intel, Iris, Plus, Graphics, 640]
1              [Intel, HD, Graphics, 6000]
2               [Intel, HD, Graphics, 620]
3                  [AMD, Radeon, Pro, 455]
4       [Intel, Iris, Plus, Graphics, 650]
                       ...
1298            [Intel, HD, Graphics, 520]
1299            [Intel, HD, Graphics, 520]
1300                 [Intel, HD, Graphics]
1301               [AMD, Radeon, R5, M330]
1302                 [Intel, HD, Graphics]
Name: gpu, Length: 1303, dtype: object

In [77]:
print(laptops["gpu"].str.split()[0]) # list
print(laptops["gpu"].str.split()[0][0]) #first elment in the list

['Intel', 'Iris', 'Plus', 'Graphics', '640']
Intel

In [78]:
manuf = []
for m in laptops["gpu"].str.split():
    first = m[0]
    manuf.append(first)
    
manuf[:10]

['Intel',
 'Intel',
 'Intel',
 'AMD',
 'Intel',
 'AMD',
 'Intel',
 'Intel',
 'Nvidia',
 'Intel']

In [79]:
laptops["gpu_manufacturer"] = manuf
print(laptops["gpu_manufacturer"].dtype)
print(laptops["gpu_manufacturer"].unique())
print(laptops["gpu_manufacturer"].value_counts())

object
['Intel' 'AMD' 'Nvidia' 'ARM']
Intel     722
Nvidia    400
AMD       180
ARM         1
Name: gpu_manufacturer, dtype: int64

In [80]:
# shorthand without looping 
laptops["gpu_manufacturer"] = laptops["gpu"].str.split().str[0]
laptops["gpu_manufacturer"]

0       Intel
1       Intel
2       Intel
3         AMD
4       Intel
        ...
1298    Intel
1299    Intel
1300    Intel
1301      AMD
1302    Intel
Name: gpu_manufacturer, Length: 1303, dtype: object

In [81]:
print(laptops["operating_system"].value_counts(dropna = False))

Windows      1125
No OS          66
Linux          62
Chrome OS      27
macOS          13
Mac OS          8
Android         2
Name: operating_system, dtype: int64

In [82]:
laptops["operating_system"].value_counts()

Windows      1125
No OS          66
Linux          62
Chrome OS      27
macOS          13
Mac OS          8
Android         2
Name: operating_system, dtype: int64

In [83]:
corrections = {
    "Windows" : "Windows",
    'No OS' : "No OS", 
    "Linux" : "Linux" , 
    "Chrome OS" : "Chrome OS",
    "Android" : "Android" , 
    "Mac OS" : "Mac OS",
    "macOS" : "Mac OS"
    
}

laptops["operating_system"] = laptops["operating_system"].map(corrections)
print(laptops["operating_system"].value_counts())

Windows      1125
No OS          66
Linux          62
Chrome OS      27
Mac OS         21
Android         2
Name: operating_system, dtype: int64

In [84]:
laptops.isnull()

,manufacturer,model_name,category,screen_size,screen,cpu,ram_gb,storage,gpu,operating_system,os,weight,price_euros,gpu_manufacturer
0,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,True,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,True,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1298,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1299,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1300,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1301,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1302,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [85]:
laptops.isnull().sum()

manufacturer          0
model_name            0
category              0
screen_size           0
screen                0
cpu                   0
ram_gb                0
storage               0
gpu                   0
operating_system      0
os                  170
weight                0
price_euros           0
gpu_manufacturer      0
dtype: int64

In [86]:
laptops_no_null_rows = laptops.dropna()
laptops_no_null_columns = laptops.dropna(axis = 1)

In [87]:
laptops_no_null_columns.head()

,manufacturer,model_name,category,screen_size,screen,cpu,ram_gb,storage,gpu,operating_system,weight,price_euros,gpu_manufacturer
0,Apple,MacBook Pro,Ultrabook,13.3,IPS Panel Retina Display 2560x1600,Intel Core i5 2.3GHz,8,128GB SSD,Intel Iris Plus Graphics 640,Mac OS,1.37kg,"1339,69",Intel
1,Apple,Macbook Air,Ultrabook,13.3,1440x900,Intel Core i5 1.8GHz,8,128GB Flash Storage,Intel HD Graphics 6000,Mac OS,1.34kg,"898,94",Intel
2,HP,250 G6,Notebook,15.6,Full HD 1920x1080,Intel Core i5 7200U 2.5GHz,8,256GB SSD,Intel HD Graphics 620,No OS,1.86kg,"575,00",Intel
3,Apple,MacBook Pro,Ultrabook,15.4,IPS Panel Retina Display 2880x1800,Intel Core i7 2.7GHz,16,512GB SSD,AMD Radeon Pro 455,Mac OS,1.83kg,"2537,45",AMD
4,Apple,MacBook Pro,Ultrabook,13.3,IPS Panel Retina Display 2560x1600,Intel Core i5 3.1GHz,8,256GB SSD,Intel Iris Plus Graphics 650,Mac OS,1.37kg,"1803,60",Intel

In [88]:
#explore the missing values to avoid removing it 
laptops["os"].value_counts(dropna = False)

10      1072
NaN      170
7         45
10 S       8
X          8
Name: os, dtype: int64

In [89]:
print(laptops["operating_system"].value_counts(dropna = False))

Windows      1125
No OS          66
Linux          62
Chrome OS      27
Mac OS         21
Android         2
Name: operating_system, dtype: int64

In [90]:
laptops.loc[laptops["os"].isnull() , "operating_system"].value_counts()

No OS        66
Linux        62
Chrome OS    27
Mac OS       13
Android       2
Name: operating_system, dtype: int64

In [91]:
#here when you delete the rows this what will happen only 2 operating systems remain
laptops_no_null_rows["operating_system"].value_counts()

Windows    1125
Mac OS        8
Name: operating_system, dtype: int64

In [92]:
# filling some missing values with assigning values with boolean condition
laptops.loc[laptops["operating_system"] == "Mac OS" , "os"] = "X"
laptops.loc[laptops["operating_system"] == "Mac OS" , "os"].value_counts()

X    21
Name: os, dtype: int64

In [93]:
# change the verion for no os system to version unknown
laptops.loc[laptops["operating_system"] == "No OS" , "os"] = "version unknown"
laptops.loc[laptops["operating_system"] == "No OS" , "os"].value_counts()

version unknown    66
Name: os, dtype: int64

In [94]:
laptops.loc[laptops["os"].isnull() , "operating_system"].value_counts()

Linux        62
Chrome OS    27
Android       2
Name: operating_system, dtype: int64

In [95]:
#the challenge is to clean the weight
print(laptops["weight"].head())

0    1.37kg
1    1.34kg
2    1.86kg
3    1.83kg
4    1.37kg
Name: weight, dtype: object

In [96]:
print(laptops["weight"].dtype)

object

In [97]:
# delete the non numeric values
laptops["weight"] = laptops["weight"].str.replace("kg" , "")
laptops["weight"] = laptops["weight"].str.replace("s" , "") #one special case ("kgs" , s remaining after remove "kg")
laptops["weight"].head()

0    1.37
1    1.34
2    1.86
3    1.83
4    1.37
Name: weight, dtype: object

In [98]:
#convert the column to numeric values
laptops["weight"] =  laptops["weight"].astype(float)
#change the column name
laptops.rename({"weight" : "weight_kg"} , axis = 1 , inplace = True)

In [99]:
laptops["weight_kg"].dtype

dtype('float64')

In [100]:
# save your changes to csv file
laptops.to_csv("laptops cleaned.csv" , index = False)